org/publish/shell.html
<?xml version="1.0" encoding="gbk"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>org-mode: 最好的文档编辑利器，没有之一</title>
<meta http-equiv="Content-Type" content="text/html;charset=gbk"/>
<meta name="title" content="org-mode: 最好的文档编辑利器，没有之一"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-26 14:11:58 中国标准时间"/>
<meta name="author" content="Weishijian"/>
<meta name="description" content=""/>
<meta name="keywords" content="emacs, org-mode"/>
<link rel="stylesheet"
    href="./style/emacs.css"
    type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">org-mode: 最好的文档编辑利器，没有之一</h1>



<ul>
<li>HOME ： 代表使用者的家目录。cd ~ 去到使用者的家目录 或者利用 cd 就可以直接回到使用者家目录了。
</li>
<li>PS1：shell的主提示符
</li>
<li>SHELL ： 目前这个环境使用的 SHELL 是哪个程序？ 如果是 bash 的话，预设是 /bin/bash
</li>
<li>PWD：用户当前工作目录的路径。它指出用户目前在Linux文件系统中处在什么位置。它是由Linux自动设置的
</li>
<li>HISTSIZE ： 这个与“历史命令”有关，曾经下达过的指令可以被系统记录下来，而记录的“数目”则是由这个值来设定的。 
</li>
<li>ENV ： 这个使用者所使用的个性化环境设置文件的读取文件。 
</li>
<li>MAIL ： 当我们使用 mail 这个指令在收信时，系统会去读取的邮件信箱文件 （mailbox)。 
</li>
<li>PATH ： 就是执行文件搜寻的路径，目录与目录中间以冒号(:)分隔， 由于文件的搜寻是依序由 PATH 的变量内的目录来查询，所以，目录的顺序也是重要的喔。 
</li>
<li>LANG ： 语系文件，很多数据都会用到他，当出现编码错误的时候往往需要设置它，中文编码是zh<sub>CN</sub>.UTF8
</li>
</ul>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">.bash_profile和.bashrc的什么区别</a>
<ul>
<li><a href="#sec-1-1">上述配置文件的作用</a></li>
<li><a href="#sec-1-2">内部变量</a></li>
</ul>
</li>
<li><a href="#sec-2">表达式</a></li>
<li><a href="#sec-3">文件测试</a></li>
<li><a href="#sec-4">判断</a></li>
<li><a href="#sec-5">一些命令</a></li>
<li><a href="#sec-6">在Linux里设置环境变量的方法（export PATH）</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">.bash_profile和.bashrc的什么区别</h2>
<div class="outline-text-2" id="text-1">

<p><i>etc/profile 存放一些全局（共有）变量，不管哪个用户，登录时都会读取该文件。通常设置一些Shell变量PATH,USER,HOSTNAME和HISTSIZE等 ~</i>.bash<sub>profile</sub>:每个用户都可使用该文件输入专用于自己使用的shell信息,当用户登录时,该文件仅仅执行一次!默认情况下,他设置一些环境变量,执行用户的.bashrc文件.
~/.bashrc:该文件包含专用于你的bash shell的bash信息,当登录时以及每次打开新的shell时,该该文件被读取.
/etc/bashrc:为每一个运行bash shell的用户执行此文件.当bash shell被打开时,该文件被读取.
</p>

<ol>
<li>/etc/profile:此文件为系统的每个用户设置环境信息,当用户第一次登录时,该文件被执行.并从/etc/profile.d目录的配置文件中搜集shell的设置.
</li>
<li><i>etc/bashrc:为每一个运行bash shell的用户执行此文件.当bash shell被打开时,该文件被读取. 3) ~</i>.bash<sub>profile</sub>:每个用户都可使用该文件输入专用于自己使用的shell信息,当用户登录时,该文件仅仅执行一次!默认情况下,他设置一些环境变量,执行用户的.bashrc文件.
</li>
<li>~/.bashrc:该文件包含专用于你的bash shell的bash信息,当登录时以及每次打开新的shell时,该文件被读取.
</li>
<li>~/.bash<sub>logout</sub>:当每次退出系统(退出bash shell)时,执行该文件. 
</li>
<li>另外,/etc/profile中设定的变量(全局)的可以作用于任何用户,而~/.bashrc等中设定的变量(局部)只能继承/etc/profile中的变量,他们是"父子"关系.
</li>
<li>~/.bash<sub>profile</sub> 是交互式、login 方式进入 bash 运行的
</li>
<li>~/.bashrc 是交互式 non-login 方式进入 bash 运行的
</li>
</ol>

<p>通常二者设置大致相同，所以通常前者会调用后者。 
</p>


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">上述配置文件的作用</h3>
<div class="outline-text-3" id="text-1-1">

<ol>
<li>登录Linux先启动系统配置文件/etc/profile，并从/etc/profile.d目录的配置文件中搜集shell的设置，为系统的每个用户设置环境信息。
</li>
<li>用户配置文件~/.bash_profile，每个用户专用于自己使用的shell信息,仅用户登录时执行一次!
        默认情况下,此文件通过脚本执行同目录下用户的.bashrc文件。
</li>
<li>~/.bashrc文件包含专用于用户bash shell的bash信息,登录及每次打开新的shell时都会执行。里面又会调用/etc/bashrc
</li>
</ol>




</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">内部变量 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="____">内部变量</span></span></h3>
<div class="outline-text-3" id="text-1-2">


<p>
  内部变量是Linux所提供的一种特殊类型的变量，这类变量在程序中用来作出判断。在shell程序内这类变量的值是不能修改的。
</p>
<p>
部分内部变量是：
</p><ol>
<li>$# ――传送给shell程序的位置参数的数量
</li>
<li>$?――最后命令的完成码或者在shell程序内部执行的shell程序（返回值）
</li>
<li>$0――shell程序的名称
</li>
<li>$*――调用shell程序时所传送的全部参数的单字符串， “参数1”“参数2”…形式保存的参数
</li>
<li>$@   “参数1”“参数2”…形式保存的参数
</li>
<li>$n   第n个参数
</li>
<li>$$   本程序的PID
</li>
<li>$!   上一个命令的PID
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">表达式</h2>
<div class="outline-text-2" id="text-2">


<ol>
<li>-lt  小于
</li>
<li>-le  小于等于
</li>
<li>-gt  大于
</li>
<li>-ge  大于等于
</li>
<li>-eq  等于
</li>
<li>-ne  不等于
</li>
</ol>






<ol>
<li>sdkflk
</li>
<li>sdfkl
</li>
<li>sdflksdl
</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">文件测试</h2>
<div class="outline-text-2" id="text-3">


<ol>
<li>-f   存在且是普通文件
</li>
<li>-d   存在且是目录
</li>
<li>-s   存在且字节数大于0
</li>
<li>-r   存在且可读
</li>
<li>-w   存在且可写
</li>
<li>-x   存在且可执行
</li>
</ol>



</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">判断</h2>
<div class="outline-text-2" id="text-4">

<ol>
<li>test  -z  s  字符串长=0,即为空串
</li>
<li>test  -n     字符串长&gt;0
</li>
<li>-a   逻辑与
</li>
<li>-o   逻辑或
</li>
<li>！   逻辑非
</li>
</ol>




</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">一些命令</h2>
<div class="outline-text-2" id="text-5">

<ol>
<li>seq命令：产生1-9的数字序列

</li>
<li>expr命令：对表达式求值
</li>
<li>[]直接求值命令：对被括起来的表达式求值
</li>
</ol>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">在Linux里设置环境变量的方法（export PATH）</h2>
<div class="outline-text-2" id="text-6">


<ol>
<li>1、直接用export命令：
</li>
</ol>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-26 14:11:58 中国标准时间</p>
<p class="author">Author: Weishijian</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
